ThirdParty-v1912/swak4Foam-latest/Examples/ImmersedBC/pitzDailyImmersed/0.org/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    pitzDailyIB
    {
        type            nutWallFunction;
        patchType       immersedBoundary;
        value           uniform 0;
    }
    top
    {
        type            zeroGradient;
        value           uniform 0;
    }
    inlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    outlet
    {
        type            zeroGradient;
        value           uniform 0;
    }
    bottom
    {
        type            zeroGradient;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
