ThirdParty-v1912/swak4Foam-latest/Examples/ImmersedBC/pitzDailyImmersed/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver           CG;
        preconditioner   Cholesky;

        minIter          1;
        maxIter          1000;
        tolerance        1e-06;
        relTol           0.01;
    }

//     p
//     {
//         solver           smoothSolver;
//         smoother         GaussSeidel;
//         nSweeps          10;

//         minIter          1;
//         maxIter          1000;
//         tolerance        1e-06;
//         relTol           0.01;
//     }
    U
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          0;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
    k
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
    epsilon
    {
        solver           BiCGStab;
        preconditioner   ILU0;

        minIter          1;
        maxIter          1000;
        tolerance        1e-08;
        relTol           0;
    }
}

SIMPLE
{
    nNonOrthogonalCorrectors 1;

    pRefPoint (0.1 0 0);
    pRefValue 0;
}

relaxationFactors
{
    equations
    {
        U          0.7;
        k          0.7;
        epsilon    0.7;
    }
    fields
    {
        p          0.3;
    }
}


// ************************************************************************* //
